{"pageProps":{"post":{"id":"Yy3SthMAAILYNZ4W","uid":"mobile-first-css-is-it-time-for-a-rethink","url":null,"type":"posts","href":"https://spacetravelingac.cdn.prismic.io/api/v2/documents/search?ref=Yy3SuxMAACUANZ4w&q=%5B%5B%3Ad+%3D+at%28document.id%2C+%22Yy3SthMAAILYNZ4W%22%29+%5D%5D","tags":[],"first_publication_date":"2022-09-23T15:37:31+0000","last_publication_date":"2022-09-23T15:37:31+0000","slugs":["mobile-first-css-is-it-time-for-a-rethink"],"linked_documents":[],"lang":"pt-br","alternate_languages":[],"data":{"title":"Mobile-First CSS: Is It Time for a Rethink?","subtitle":"The mobile-first design methodology is great—it focuses on what really matters to the user, it’s well-practiced, and it’s been a common design pattern for years. So developing your CSS mobile-first should also be great, too…right?","author":"Patrick Clancey","image":{"dimensions":{"width":1500,"height":940},"alt":"Octopus Cooking","copyright":null,"url":"https://images.prismic.io/spacetravelingac/42bab0e0-bf47-46b4-8d07-3cf826263f35_mobile-first-css-time-for-a-rethink.webp?auto=compress,format"},"content":[{"heading":"The mobile-first design methodology is great—it focuses on what really matters to the user, it’s well-practiced, and it’s been a common design pattern for years. So developing your CSS mobile-first should also be great, too…right?","body":[{"type":"paragraph","text":"Well, not necessarily. Classic mobile-first CSS development is based on the principle of overwriting style declarations: you begin your CSS with default style declarations, and overwrite and/or add new styles as you add breakpoints with min-width media queries for larger viewports (for a good overview see “What is Mobile First CSS and Why Does It Rock?”). But all those exceptions create complexity and inefficiency, which in turn can lead to an increased testing effort and a code base that’s harder to maintain. Admit it—how many of us willingly want that?","spans":[{"start":308,"end":354,"type":"hyperlink","data":{"link_type":"Web","url":"https://www.mightyminnow.com/2013/11/what-is-mobile-first-css-and-why-does-it-rock/"}}]},{"type":"paragraph","text":"On your own projects, mobile-first CSS may yet be the best tool for the job, but first you need to evaluate just how appropriate it is in light of the visual design and user interactions you’re working on. To help you get started, here’s how I go about tackling the factors you need to watch for, and I’ll discuss some alternate solutions if mobile-first doesn’t seem to suit your project.","spans":[]}]},{"heading":"Advantages of mobile-first","body":[{"type":"paragraph","text":"Some of the things to like with mobile-first CSS development—and why it’s been the de facto development methodology for so long—make a lot of sense:","spans":[]},{"type":"paragraph","text":"Development hierarchy. One thing you undoubtedly get from mobile-first is a nice development hierarchy—you just focus on the mobile view and get developing. ","spans":[{"start":0,"end":23,"type":"strong"}]},{"type":"paragraph","text":"Tried and tested. It’s a tried and tested methodology that’s worked for years for a reason: it solves a problem really well.","spans":[{"start":0,"end":18,"type":"strong"}]},{"type":"paragraph","text":"Prioritizes the mobile view. The mobile view is the simplest and arguably the most important, as it encompasses all the key user journeys, and often accounts for a higher proportion of user visits (depending on the project). ","spans":[{"start":0,"end":27,"type":"strong"},{"start":51,"end":52,"type":"strong"},{"start":60,"end":61,"type":"strong"},{"start":100,"end":137,"type":"strong"},{"start":164,"end":196,"type":"strong"}]},{"type":"paragraph","text":"Prevents desktop-centric development. As development is done using desktop computers, it can be tempting to initially focus on the desktop view. But thinking about mobile from the start prevents us from getting stuck later on; no one wants to spend their time retrofitting a desktop-centric site to work on mobile devices!","spans":[{"start":0,"end":38,"type":"strong"}]}]},{"heading":"Disadvantages of mobile-first","body":[{"type":"paragraph","text":"Setting style declarations and then overwriting them at higher breakpoints can lead to undesirable ramifications:","spans":[]},{"type":"paragraph","text":"More complexity. The farther up the breakpoint hierarchy you go, the more unnecessary code you inherit from lower breakpoints. ","spans":[{"start":0,"end":17,"type":"strong"}]},{"type":"paragraph","text":"Higher CSS specificity. Styles that have been reverted to their browser default value in a class name declaration now have a higher specificity. This can be a headache on large projects when you want to keep the CSS selectors as simple as possible.","spans":[{"start":0,"end":24,"type":"strong"}]},{"type":"paragraph","text":"Requires more regression testing. Changes to the CSS at a lower view (like adding a new style) requires all higher breakpoints to be regression tested.","spans":[{"start":0,"end":34,"type":"strong"}]},{"type":"paragraph","text":"The browser can’t prioritize CSS downloads. At wider breakpoints, classic mobile-first min-width media queries don’t leverage the browser’s capability to download CSS files in priority order.","spans":[{"start":0,"end":44,"type":"strong"}]}]},{"heading":"The problem of property value overrides","body":[{"type":"paragraph","text":"There is nothing inherently wrong with overwriting values; CSS was designed to do just that. Still, inheriting incorrect values is unhelpful and can be burdensome and inefficient. It can also lead to increased style specificity when you have to overwrite styles to reset them back to their defaults, something that may cause issues later on, especially if you are using a combination of bespoke CSS and utility classes. We won’t be able to use a utility class for a style that has been reset with a higher specificity.","spans":[]},{"type":"paragraph","text":"With this in mind, I’m developing CSS with a focus on the default values much more these days. Since there’s no specific order, and no chains of specific values to keep track of, this frees me to develop breakpoints simultaneously. I concentrate on finding common styles and isolating the specific exceptions in closed media query ranges (that is, any range with a max-width set). ","spans":[{"start":216,"end":230,"type":"em"}]},{"type":"paragraph","text":"This approach opens up some opportunities, as you can look at each breakpoint as a clean slate. If a component’s layout looks like it should be based on Flexbox at all breakpoints, it’s fine and can be coded in the default style sheet. But if it looks like Grid would be much better for large screens and Flexbox for mobile, these can both be done entirely independently when the CSS is put into closed media query ranges. Also, developing simultaneously requires you to have a good understanding of any given component in all breakpoints up front. This can help surface issues in the design earlier in the development process. We don’t want to get stuck down a rabbit hole building a complex component for mobile, and then get the designs for desktop and find they are equally complex and incompatible with the HTML we created for the mobile view! ","spans":[]},{"type":"paragraph","text":"Though this approach isn’t going to suit everyone, I encourage you to give it a try. There are plenty of tools out there to help with concurrent development, such as Responsively App, Blisk, and many others. ","spans":[{"start":166,"end":182,"type":"hyperlink","data":{"link_type":"Web","url":"https://responsively.app/"}},{"start":184,"end":189,"type":"hyperlink","data":{"link_type":"Web","url":"https://blisk.io/"}}]},{"type":"paragraph","text":"Having said that, I don’t feel the order itself is particularly relevant. If you are comfortable with focusing on the mobile view, have a good understanding of the requirements for other breakpoints, and prefer to work on one device at a time, then by all means stick with the classic development order. The important thing is to identify common styles and exceptions so you can put them in the relevant stylesheet—a sort of manual tree-shaking process! Personally, I find this a little easier when working on a component across breakpoints, but that’s by no means a requirement.","spans":[]}]},{"heading":null,"body":[{"type":"paragraph","text":"In classic mobile-first CSS we overwrite the styles, but we can avoid this by using media query ranges. To illustrate the difference (I’m using SCSS for brevity), let’s assume there are three visual designs: ","spans":[]},{"type":"list-item","text":"smaller than 768","spans":[]},{"type":"list-item","text":"from 768 to below 1024","spans":[]},{"type":"list-item","text":"1024 and anything larger ","spans":[]},{"type":"paragraph","text":"Take a simple example where a block-level element has a default padding of “20px,” which is overwritten at tablet to be “40px” and set back to “20px” on desktop.","spans":[]},{"type":"image","url":"https://images.prismic.io/spacetravelingac/38c9555a-cdb0-4814-b498-f2e4e0dc4c3a_Screenshot+from+2022-09-23+12-33-11.png?auto=compress,format","alt":"Code sample","copyright":null,"dimensions":{"width":781,"height":577}},{"type":"paragraph","text":"The subtle difference is that the mobile-first example sets the default padding to “20px” and then overwrites it at each breakpoint, setting it three times in total. In contrast, the second example sets the default padding to “20px” and only overrides it at the relevant breakpoint where it isn’t the default value (in this instance, tablet is the exception).","spans":[]},{"type":"paragraph","text":"The goal is to: ","spans":[]},{"type":"list-item","text":"Only set styles when needed. ","spans":[]},{"type":"list-item","text":"Not set them with the expectation of overwriting them later on, again and again. ","spans":[{"start":22,"end":33,"type":"em"}]},{"type":"paragraph","text":"To this end, closed media query ranges are our best friend. If we need to make a change to any given view, we make it in the CSS media query range that applies to the specific breakpoint. We’ll be much less likely to introduce unwanted alterations, and our regression testing only needs to focus on the breakpoint we have actually edited. ","spans":[]},{"type":"paragraph","text":"Taking the above example, if we find that .my-block spacing on desktop is already accounted for by the margin at that breakpoint, and since we want to remove the padding altogether, we could do this by setting the mobile padding in a closed media query range.","spans":[]},{"type":"paragraph","text":"The browser default padding for our block is “0,” so instead of adding a desktop media query and using unset or “0” for the padding value (which we would need with mobile-first), we can wrap the mobile padding in a closed media query (since it is now also an exception) so it won’t get picked up at wider breakpoints. At the desktop breakpoint, we won’t need to set any padding style, as we want the browser default value.","spans":[]},{"type":"paragraph","text":"","spans":[]},{"type":"paragraph","text":"","spans":[]},{"type":"paragraph","text":"","spans":[]}]}]}}},"__N_SSG":true}